#### Tratamiento de variables categoricas

In [1]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression

In [3]:
url = "https://raw.githubusercontent.com/joanby/python-ml-course/master/datasets/ecom-expense/Ecom%20Expense.csv"
df = pd.read_csv(url)
df.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485

In [5]:
dummy_gender = pd.get_dummies(df["Gender"], prefix = "Gender")
dummy_city_tier = pd.get_dummies(df["City Tier"], prefix="City")

In [6]:
dummy_gender.head()

   Gender_Female  Gender_Male
0              1            0
1              1            0
2              0            1
3              1            0
4              1            0

In [7]:
dummy_city_tier.head()

   City_Tier 1  City_Tier 2  City_Tier 3
0            1            0            0
1            0            1            0
2            0            1            0
3            1            0            0
4            0            1            0

In [8]:
#Fusion de dataframes
column_names = df.columns.values.tolist()
column_names

['Transaction ID',
 'Age ',
 ' Items ',
 'Monthly Income',
 'Transaction Time',
 'Record',
 'Gender',
 'City Tier',
 'Total Spend']

In [9]:
df_new = df[column_names].join(dummy_gender)
column_names = df_new.columns.values.tolist()
df_new.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend,Gender_Female,Gender_Male
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084,1,0
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648,1,0
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455,0,1
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676,1,0
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485,1,0

In [11]:
df_new = df_new[column_names].join(dummy_city_tier)
df_new.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend,Gender_Female,Gender_Male,City_Tier 1,City_Tier 2,City_Tier 3
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084,1,0,1,0,0
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648,1,0,0,1,0
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455,0,1,0,1,0
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676,1,0,1,0,0
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485,1,0,0,1,0

In [12]:
features_cols = ["Monthly Income", "Transaction Time", 
                 "Gender_Female", "Gender_Male", 
                 "City_Tier 1", "City_Tier 2", "City_Tier 3"]

In [14]:
X = df_new[features_cols]
Y = df_new["Total Spend"]

In [15]:
lm = LinearRegression()
lm.fit(X,Y)

LinearRegression()

In [16]:
print(lm.intercept_)
print(lm.coef_)

3655.729407690652
[   0.15297825    0.12372609  -94.15779883   94.15779883  119.6632516
  -16.67901801 -102.9842336 ]

In [18]:
zip(features_cols, lm.coef_)

In [19]:
list(zip(features_cols, lm.coef_))
#Coeficientes para cada una de las variables.

[('Monthly Income', 0.1529782460932052),
 ('Transaction Time', 0.12372608642620012),
 ('Gender_Female', -94.15779883032015),
 ('Gender_Male', 94.15779883032013),
 ('City_Tier 1', 119.66325160390097),
 ('City_Tier 2', -16.679018007990393),
 ('City_Tier 3', -102.98423359591065)]

In [20]:
lm.score(X,Y)
#R^2 bajo, al modelo le falta informacion.

0.19478920552885381

##### Añadir variables para ver si mejora.

In [38]:
features_cols = ["Monthly Income", "Transaction Time", 
                 "Gender_Female", "Gender_Male", 
                 "City_Tier 1", "City_Tier 2", "City_Tier 3", "Record"]
X = df_new[features_cols]
Y = df_new["Total Spend"]

lm = LinearRegression()
lm.fit(X,Y)

LinearRegression()

In [39]:
print(lm.intercept_)
print(lm.coef_)

-79.41713030137453
[ 1.47538980e-01  1.54946125e-01 -1.31025013e+02  1.31025013e+02
  7.67643260e+01  5.51389743e+01 -1.31903300e+02  7.72233446e+02]

In [40]:
zip(features_cols, lm.coef_)

In [41]:
list(zip(features_cols, lm.coef_))

[('Monthly Income', 0.14753898049205744),
 ('Transaction Time', 0.154946125495895),
 ('Gender_Female', -131.02501325554584),
 ('Gender_Male', 131.02501325554596),
 ('City_Tier 1', 76.76432601049525),
 ('City_Tier 2', 55.13897430923255),
 ('City_Tier 3', -131.90330031972792),
 ('Record', 772.2334457445648)]

In [42]:
lm.score(X,Y)
# R^2 coeficiente muy grande. al añadir la variable aumentan

0.9179923586131016

* El modelo puede ser escrito como:
    Total_Spend = -79.41713030137453 + 
            'Monthly Income' * 0.14753898049205744 + 
            'Transaction Time' * 0.154946125495895 +
            'Gender_Female' * -131.02501325554584 +
            'Gender_Male' * 131.02501325554596 +
            'City_Tier 1' * 76.76432601049525 +
            'City_Tier 2' * 55.13897430923255 +
            'City_Tier 3' * -131.90330031972792 +
            'Record' * 772.2334457445648
            
* si el hombre vive en CT1: 
    Total_Spend = -79.41713030137453 + 
            'Monthly Income' * 0.14753898049205744 + 
            'Transaction Time' * 0.154946125495895 +
             131.02501325554596 +
             76.76432601049525 +
            'Record' * 772.2334457445648
            
Gender Male = 1
City_Tier 1 = 1
Gender female = 0
City_Tier2 y City_Tier3 = 0
Record es una de las variables con un coeficiente mas alto por lo que es una de las variables con mas peso.

#### Habria que realizar un modelo para cada caso.

In [43]:
df_new["Prediction"] = -79.41713030137453 + df_new['Monthly Income'] * 0.14753898049205744 + df_new['Transaction Time'] * 0.154946125495895 + df_new['Gender_Female'] * -131.02501325554584 + df_new['Gender_Male'] * 131.02501325554596 + df_new['City_Tier 1'] * 76.76432601049525 + df_new['City_Tier 2'] * 55.13897430923255 + df_new['City_Tier 3'] * -131.90330031972792 + df_new['Record'] * 772.2334457445648

In [44]:
df_new.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend,Gender_Female,Gender_Male,City_Tier 1,City_Tier 2,City_Tier 3,Prediction
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084,1,0,1,0,0,4903.696720
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648,1,0,0,1,0,4799.434826
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455,0,1,0,1,0,5157.082504
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676,1,0,1,0,0,8068.012996
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485,1,0,0,1,0,3581.980335

In [53]:
#Suma de los cuadrados de las diferencias.
SSD = np.sum((df_new["Prediction"] - df_new["Total Spend"])**2)

In [54]:
SSD

1517733985.340816

In [55]:
#Desviacion tipica de los residuos
RSE = np.sqrt(SSD/(len(df_new)-len(features_cols)-1))
RSE

803.1318809818165

In [56]:
sales_mean = np.mean(df_new["Total Spend"])
sales_mean

6163.176415976714

In [57]:
#Error
error = RSE/sales_mean
error

##Se trata de un modelo muy preciso con un error del 13%.

0.13031135680294162

#### Añadimos la variable age.

In [25]:
features_cols = ["Monthly Income", "Transaction Time", 
                 "Gender_Female", "Gender_Male", 
                 "City_Tier 1", "City_Tier 2", "City_Tier 3", "Record", "Age "]
X = df_new[features_cols]
Y = df_new["Total Spend"]

lm = LinearRegression()
lm.fit(X,Y)

zip(features_cols, lm.coef_)

In [28]:
list(zip(features_cols, lm.coef_))

[('Monthly Income', 0.1474422689744858),
 ('Transaction Time', 0.1563915830636618),
 ('Gender_Female', -133.0887066317054),
 ('Gender_Male', 133.08870663170535),
 ('City_Tier 1', 78.37850497640339),
 ('City_Tier 2', 52.02596334431926),
 ('City_Tier 3', -130.40446832072269),
 ('Record', 772.1492053631357),
 ('Age ', 6.424298167612874)]

In [26]:
lm.score(X,Y)

0.9187458997709432

In [27]:
# Se puede observar que apenas ha aumentado por lo que la edad no es una variable adecuada para este modelo.

# Eliminar Variables Dummy redundantes.
* Elimina la cantidad de modelos para cada caso de las variables dummys

In [59]:
dummy_gender = pd.get_dummies(df["Gender"], prefix= "Gender").iloc[:, 1:]
dummy_gender.head()

   Gender_Male
0            0
1            0
2            1
3            0
4            0

In [63]:
dummy_city_tier = pd.get_dummies(df["City Tier"], prefix="City").iloc[:,1:]
dummy_city_tier.head()

   City_Tier 2  City_Tier 3
0            0            0
1            1            0
2            1            0
3            0            0
4            1            0

In [67]:
column_names = df.columns.values.tolist()
df_new = df[column_names].join(dummy_gender)
column_names = df_new.columns.values.tolist()
df_new = df_new[column_names].join(dummy_city_tier)
df_new.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend,Gender_Male,City_Tier 2,City_Tier 3
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084,0,0,0
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648,0,1,0
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455,1,1,0
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676,0,0,0
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485,0,1,0

In [72]:
feature_cols = ["Monthly Income", "Transaction Time", "Gender_Male", "City_Tier 2", "City_Tier 3", "Record"]
X = df_new[feature_cols]
Y = df_new["Total Spend"]
lm = LinearRegression()
lm.fit(X,Y)

LinearRegression()

In [73]:
print(lm.intercept_)

-133.67781754642238

In [74]:
list(zip(feature_cols, lm.coef_))

[('Monthly Income', 0.14753898049205746),
 ('Transaction Time', 0.1549461254958972),
 ('Gender_Male', 262.05002651109595),
 ('City_Tier 2', -21.62535170126301),
 ('City_Tier 3', -208.66762633022316),
 ('Record', 772.2334457445637)]

In [75]:
lm.score(X,Y)
#Los cambios en los coeficientes no varian el modelo pero ayudan a la simplificacion del mismo.

0.9179923586131016